<a href="https://colab.research.google.com/github/PANDATD/DATAVISULIZATION/blob/master/pandas_demo.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [17]:
import pandas as pd 
# package is being imported

In [18]:
#df = pd.read_csv('data.csv')
note  = """df is an dataframe and dataframe is nothing but rows and columns
pd.read_csv method reads the csv data from csv file"""

In [19]:
#df.shape
# it returns the rows and coloumns , note : don't include () after the shape

In [20]:
#df.info() # it prints the overall info

In [21]:
people = {
    'name':['pandatd','vbg','d','kunal','ceo','mukesh'],
    'companay':['coddersclub','coddersclub','coddersclub','coddersclub','coddersclub','client'],
    'email':['pandatd@coddersclub.com','vbg@coddersclub.com','d.coddersclub.com','kunal@coddersclub.com','ceo@coddersclub.com','mueksh@client-coddersclub.com']
}
#print("This is Dict: ",people)
new_df = pd.DataFrame(people)#new dataframe is created using people Dict
#new_df

In [22]:
new_df

      name     companay                          email
0  pandatd  coddersclub        pandatd@coddersclub.com
1      vbg  coddersclub            vbg@coddersclub.com
2        d  coddersclub              d.coddersclub.com
3    kunal  coddersclub          kunal@coddersclub.com
4      ceo  coddersclub            ceo@coddersclub.com
5   mukesh       client  mueksh@client-coddersclub.com

In [23]:
note_iloc = """
1) iloc is stands for integer location.
2) iloc only takes integer as location.
       """
print(note_iloc)
#new_df.iloc[0]# By using iloc we fetched the first index 
# Not only we use integer but also a slicicing as we done in list or tuple.
# But hear's indexing is diff we can not use [] this brackes only we pass the vale like 0:2.
# let's take an exmple of slicing with iloc
new_df.iloc[:2]
# Above statment is an example of slicing

1) iloc is stands for integer location.
2) iloc only takes integer as location.

      name     companay                    email
0  pandatd  coddersclub  pandatd@coddersclub.com
1      vbg  coddersclub      vbg@coddersclub.com

In [24]:
# Now we see loc 
note_loc = """
            1) loc is stands for location 
           """
#new_df.columns # Feching the column names 
new_df.loc[0:3:2, 'name':'companay']
# In above example we will fetched the data usinig loc method
# In above exmple we did the slicing 
new_df.loc[[1,2],['name','companay']]
# In above the example we wiil fetched the 1,and second record assosiate to 'name' and 'company'.

  name     companay
1  vbg  coddersclub
2    d  coddersclub

In [25]:
new_df[['name','email']]

      name                          email
0  pandatd        pandatd@coddersclub.com
1      vbg            vbg@coddersclub.com
2        d              d.coddersclub.com
3    kunal          kunal@coddersclub.com
4      ceo            ceo@coddersclub.com
5   mukesh  mueksh@client-coddersclub.com

In [26]:
#df.columns
#def get_data(rowstart:int =0,rowend:int=5,
 #            col1=0,col2=5)->object:
  #  return df.iloc[rowstart:rowend, col1:col2]

#get_data(rowstart=0,rowend=20,col1=2,col2=4)